## 🏗️ Terraform Plan Summary

**Environment:** 🧪 `dev`

| Step | Status |
|------|:------:|
| 🖌 Format & Style | ✅ `success` |
| ⚙️ Initialization | ✅ `success` |
| 🤖 Validation | ✅ `success` |
| 📖 Plan | ✅ `success` |

<details><summary>Plan Output</summary>

```terraform
data.terraform_remote_state.main: Reading...
random_id.bucket_suffix: Refreshing state... [id=Q4Swjw]
data.terraform_remote_state.main: Read complete after 0s
google_service_account.app: Refreshing state... [id=projects/search-ahmed/serviceAccounts/dorothea-dev@search-ahmed.iam.gserviceaccount.com]
data.google_project.project: Reading...
google_vertex_ai_reasoning_engine.session_and_memory: Refreshing state... [id=projects/search-ahmed/locations/us-central1/reasoningEngines/4039565038518796288]
google_storage_bucket.artifact_service: Refreshing state... [id=dorothea-dev-artifact-service-4384b08f]
google_project_iam_member.app["roles/logging.logWriter"]: Refreshing state... [id=search-ahmed/roles/logging.logWriter/serviceAccount:dorothea-dev@search-ahmed.iam.gserviceaccount.com]
google_project_iam_member.app["roles/storage.bucketViewer"]: Refreshing state... [id=search-ahmed/roles/storage.bucketViewer/serviceAccount:dorothea-dev@search-ahmed.iam.gserviceaccount.com]
google_project_iam_member.app["roles/cloudtrace.agent"]: Refreshing state... [id=search-ahmed/roles/cloudtrace.agent/serviceAccount:dorothea-dev@search-ahmed.iam.gserviceaccount.com]
google_project_iam_member.app["roles/serviceusage.serviceUsageConsumer"]: Refreshing state... [id=search-ahmed/roles/serviceusage.serviceUsageConsumer/serviceAccount:dorothea-dev@search-ahmed.iam.gserviceaccount.com]
google_project_iam_member.app["roles/aiplatform.user"]: Refreshing state... [id=search-ahmed/roles/aiplatform.user/serviceAccount:dorothea-dev@search-ahmed.iam.gserviceaccount.com]
google_project_iam_member.app["roles/storage.objectUser"]: Refreshing state... [id=search-ahmed/roles/storage.objectUser/serviceAccount:dorothea-dev@search-ahmed.iam.gserviceaccount.com]
google_project_iam_member.app["roles/telemetry.tracesWriter"]: Refreshing state... [id=search-ahmed/roles/telemetry.tracesWriter/serviceAccount:dorothea-dev@search-ahmed.iam.gserviceaccount.com]
google_cloud_run_v2_service.app["us-central1"]: Refreshing state... [id=projects/search-ahmed/locations/us-central1/services/dorothea-dev]
data.google_project.project: Read complete after 1s [id=projects/search-ahmed]
google_cloud_run_v2_service_iam_member.chat_invoker["us-central1"]: Refreshing state... [id=projects/search-ahmed/locations/us-central1/services/dorothea-dev/roles/run.invoker/serviceAccount:service-36231825761@gcp-sa-gsuiteaddons.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_cloud_run_v2_service.app["us-central1"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_cloud_run_v2_service" "app" {
      + annotations             = (known after apply)
      + binary_authorization    = (known after apply)
      + build_config            = (known after apply)
      + client                  = (known after apply)
      + client_version          = (known after apply)
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + custom_audiences        = (known after apply)
      + default_uri_disabled    = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = (known after apply)
      + description             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + iap_enabled             = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + invoker_iam_disabled    = (known after apply)
      + labels                  = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + multi_region_settings   = (known after apply)
      + name                    = "dorothea-dev"
      + observed_generation     = (known after apply)
      + reconciling             = (known after apply)
      + scaling                 = (known after apply)
      + template                = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic                 = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)
    }

  # google_cloud_run_v2_service.app["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_v2_service" "app" {
        id                      = "projects/search-ahmed/locations/us-central1/services/dorothea-dev"
        name                    = "dorothea-dev"
        # (35 unchanged attributes hidden)

      ~ template {
            # (11 unchanged attributes hidden)

          ~ containers {
              ~ image          = "us-central1-docker.pkg.dev/search-ahmed/dorothea-dev/dorothea@sha256:f9251e21a4f9b7b5d4eea7cafd3d89a839c0d4fc374ce330739f9fd590ab6680" -> "us-central1-docker.pkg.dev/search-ahmed/dorothea-dev/dorothea@sha256:2fd9ad9843dff21caecaeec46cede04dee868b9211ddf8333e6018968eaad105"
                name           = null
                # (6 unchanged attributes hidden)

                # (17 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ cloud_run_services               = {
      ~ us-central1 = {
          ~ latest_ready_revision = "dorothea-dev-00010-nff" -> (known after apply)
          ~ update_time           = "2026-02-27T06:16:09.683109Z" -> (known after apply)
          ~ uri                   = "https://dorothea-dev-oxigyhdstq-uc.a.run.app" -> (known after apply)
        }
    }
  ~ deployed_image                   = "us-central1-docker.pkg.dev/search-ahmed/dorothea-dev/dorothea@sha256:f9251e21a4f9b7b5d4eea7cafd3d89a839c0d4fc374ce330739f9fd590ab6680" -> "us-central1-docker.pkg.dev/search-ahmed/dorothea-dev/dorothea@sha256:2fd9ad9843dff21caecaeec46cede04dee868b9211ddf8333e6018968eaad105"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan-dev

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan-dev"
```

</details>

---